Ehuntabi/victron-jc1060p470c-esp32p4/sdkconfig.defaults
#
# sdkconfig.defaults — Guition JC1060P470C_I (ESP32-P4)
#
# Aplica con:  idf.py set-target esp32p4 && idf.py reconfigure
#
# Estos valores sobreescriben los defaults de IDF para este hardware.
# Las opciones de WiFi, BLE, SPIFFS y NVS del proyecto original
# se mantienen tal cual en el sdkconfig generado.
#

# ── Target ────────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32p4"

# ── Optimizacion del compilador ─────────────────────────────────────────────
# -O2 (rendimiento) en vez del -Og por defecto de IDF. Assertions se dejan
# ACTIVAS (no tocar CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_*): -O2 con asserts
# sigue cazando estados invalidos. Aplicado 2026-07-09 con protocolo known-good
# (tag sdkconfig-known-good-2026-07-09-pre-O2 de respaldo).
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ── CPU ───────────────────────────────────────────────────────────────────────
# El módulo ESP32-P4 soporta hasta 400 MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# ── Flash (16 MB) ─────────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ── PSRAM (32 MB integrada en el módulo) ──────────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Los buffers LVGL residen en PSRAM (buff_spiram = true en bsp_display_cfg_t)
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# ── LVGL ──────────────────────────────────────────────────────────────────────
# RGB565 — 16 bits/px (mismo que el proyecto original)
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=n
# Pool de LVGL: malloc/free del sistema en vez del array estatico de 128KB.
# Razon: con N device cards en Victron Keys (cada una con shadow_width=14) el
# pool fijo se llena y draw_shadow no consigue su buffer temporal -> assert
# Out-of-memory -> taskLVGL atascado -> TASK_WDT bootloop.
CONFIG_LV_MEM_CUSTOM=y

# ── Stack de tareas ───────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ── I2C ───────────────────────────────────────────────────────────────────────
# El driver i2c_new_master_bus no requiere configuración en sdkconfig.
# Asegúrate de que BSP_I2C_NUM en display.h coincide con el bus que uses.

# ── MIPI-DSI ──────────────────────────────────────────────────────────────────
# El driver esp_lcd_mipi_dsi está integrado en IDF para ESP32-P4.
# No requiere opción Kconfig adicional; se activa como dependencia CMake.

# ── DMA2D (acelerador 2D para relleno de framebuffer) ─────────────────────────
CONFIG_SOC_DMA2D_SUPPORTED=y

# ── BLE + WiFi (heredados del proyecto original) ──────────────────────────────
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# BLE NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
# Stack del host task: 4096 dejaba solo ~628 bytes libres min (medido 2026-07-09,
# ui_on_panel_data actualiza labels LVGL bajo lock en esta task). 6144 = colchon.
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144

# LVGL fonts
# 14/20/24/28/46 estan aliased a Inter en main/fonts/fonts_es.h
# (los built-in Montserrat de esos tamanos los descarta --gc-sections).
# 32 y 36 si se usan directamente.
# 40 y 48: 0 referencias en el proyecto -> deshabilitadas (~150KB ROM
# fuente de datos const de glifos).
CONFIG_LV_FONT_MONTSERRAT_24=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Coredump por UART (vuelca ELF base64 al panicar; sin particion extra).
# Extraccion: idf.py monitor -> copiar bloque CORE DUMP START..END;
# luego espcoredump.py info_corefile -t b64 dump.b64
CONFIG_ESP_COREDUMP_ENABLE_TO_UART=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y

# BLE via VHCI over SDIO (ESP32-C6)
CONFIG_ESP_ENABLE_BT=y
CONFIG_ESP_HCI_VHCI=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n


# Camara MIPI-CSI. El device CSI habilita tambien el ISP.
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
# El sensor de esta board NO es un SC2336 (eso venia de la doc original, es
# falso): es un OV02C10. Fuera su auto-detect, que responde en la misma
# direccion SCCB y se adelantaria.
CONFIG_CAMERA_SC2336=n

# Driver OFICIAL del OV02C10 (PR espressif/esp-video-components#46) en
# components/ov02c10/, con su perfil de ajuste (IPA) en cfg/. Con el perfil
# registrado, el controlador de la cadena del ISP revela por HARDWARE: color,
# balance de blancos, ruido y exposicion automatica, sin gastar CPU.
CONFIG_CAMERA_OV02C10=y
CONFIG_CAMERA_OV02C10_AUTO_DETECT=y
CONFIG_CAMERA_OV02C10_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_OV02C10_MIPI_RAW10_1920x1080_2LAN_30FPS=y
CONFIG_CAMERA_OV02C10_DEFAULT_IPA_JSON_CONFIGURATION_FILE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192
# CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE is not set

# ── Servidor HTTP (config web + API de la app Android) ────────────────────────
# Buffer de cabeceras de peticion. El default 512 se queda corto en el login
# Basic-Auth desde navegador movil (User-Agent + Accept + cookies + Authorization
# se pasan de 512 -> error "Header fields are too long"). 2048 da margen a
# navegador y app; coste ~+1.5KB por conexion. 2026-07-12.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
